Revit 2027 API
ExporterIFCUtils.GetOpeningData Method
 Gets the openings data from the element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IFCOpeningData> GetOpeningData(
	ExporterIFC exporterIFC,
	Element element,
	Transform lcs,
	IFCRange range
)
Public Shared Function GetOpeningData (
	exporterIFC As ExporterIFC,
	element As Element,
	lcs As Transform,
	range As IFCRange
) As IList(Of IFCOpeningData)
public:
static IList<IFCOpeningData^>^ GetOpeningData(
	ExporterIFC^ exporterIFC,
	Element^ element,
	Transform^ lcs,
	IFCRange^ range
)
static member GetOpeningData :
        exporterIFC : ExporterIFC *
        element : Element *
        lcs : Transform *
        range : IFCRange -> IList<IFCOpeningData>
Parameters
exporterIFC ExporterIFC
 The exporter.
element Element
 The element.
lcs Transform
 The local coordinate system for the extrusion.
range IFCRange
 The range. This consists of two double values representing the height in Z at the start and the end of the range. If the values are identical the entire element is used.
Return Value
IList<IFCOpeningData>
 The opening data.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace